import * as React from 'react';
import { RouteComponentProps } from 'react-router-dom';

export default class Home extends React.Component<RouteComponentProps<{}>, {}> {


  public render() {


    const plainText: JSX.Element = <p>Реалізація стратегічного курсу Президента України на модернізацію Української держави, трансформація державно-управлінських відносин, швидкісні перетворення соціального життя зумовлюють актуальність грунтовного дослідження проблем забезпечення реалізації права громадян на звернення до органів влади. Адже саме через них втілюється в життя один із конституційних принципів - участі громадян в управлінні державними та громадськими справами. Звернення є також важливою формою контролю за законністю діяльності державних органів і органів місцевого самоврядування, забезпечення прав і свобод громадян.  Для реалізації вище поставлених завдань розблено автоматизовану систему реагування на звернення громадян щодо інцидентів, яка має на меті покращити та пришвидшити роботу міських служб шляхом допомоги від пересічних жителів.</p>;

    return <div>
      {plainText}
    </div>;
  }
}
